Autodesk.Revit.DB.LayoutRuleClearSpacing.JustifyType
Get or set the type of justification.
Remarks: The justifyType passed in must be a valid object.

Autodesk.Revit.DB.LayoutRuleClearSpacing.Spacing
Get or set the spacing of the beam system.
Remarks: The value of spacing must be in [0, 30000), but in fact the spacing
should not be too small or too great.

Autodesk.Revit.DB.LayoutRuleClearSpacing.#ctor(System.Double,Autodesk.Revit.DB.BeamSystemJustifyType)
Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in.
spacing:  The value of spacing must be in [0, 30000).
justifyType:  The type of the justification, it's corresponding to the items in the element properties dialog.
Remarks: The value of spacing must be in [0, 30000), but in fact the spacing should not be too small or too great.

Autodesk.Revit.DB.LayoutRuleClearSpacing
This class indicate the layout rule of a Beam System is Clear-Spacing.
Remarks: To use this type of LayoutRule, the distance between the beams and the justify-type must be set.